Revit 2027 API
FabricationPartSizeMap.IsProductList Property
 Are the sizes for a product listed fabrication part.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsProductList { get; set; }
Public Property IsProductList As Boolean
	Get
	Set
public:
property bool IsProductList {
	bool get ();
	void set (bool value);
}
member IsProductList : bool with get, set
Property Value
Boolean
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace